import '../model/last_move.dart';

class LastMoves {
  static List<LastMove> lastMoves = [
    LastMove(
        name: 'سکوت بره ها',
        description:
            'بازیکن اخراجی با نشان کردن دو نفر٬ آنان را بمدت یک روز سایلنت کرده و افرادی که نشان شده باشند٬ فردا حتی در دفاع امکان صحبت کردن ندارند. اگر تعداد بازیکنان به نصف رسید٬ در سکوت بره ها یک نفر سایلنت خواهد شد. ',
        action: ''),
    LastMove(
        name: 'افشای هویت',
        description:
            'اگر بازیکن اخراجی این کارت را انتخاب کند٬ گرداننده بدون نیاز به استعالم جمعی نقش دقیق او را فاش میکند و او از بازی بیرون میرود. در این حالت امکان بازگشت به بازی توسط کنستانتین را ندارد. ',
        action: ''),
    LastMove(
        name: 'ذهن زیبا',
        description:
            ' اگر صاحب این کارت بتواند فقط نوستراداموس را از بین بازیکنان داخل بازی شناسایی کند. به بازی برمیگردد و نوستراداموس بجای او از بازی خارج میشود.,  اگر نوستراداموس این کارت را انتخاب کند٬ بدون نیاز به استعالم به بازی باز میگردد اما سپر وی از بین رفته و با شلیک شب کشته خواهد شد',
        action: 'نوستراداموس کیست؟'),
    LastMove(
        name: 'دستبند',
        description:
            ' بازیکن اخراجی با کارت دستبند هرکس را نشان کند٬ توانمندی های ان شب را از وی میگیرد , نکته: اگر تنها یک مافیا در بازی مانده باشد و کارت دسبتند دریافت کرده باشد٬ همچنان امکان شلیک خواهد داشت. شات مختص به یک مافیا نیست٬ یک توانایی تیمی است',
        action:
            'دستبند را جلوی یکی از بازیکنان بگذارید و توانمندی های او را از وی بگیرید.'),
    LastMove(
        name: 'تغییر چهره',
        description:
            ' بازیکن قبل از خروج کارت نقش خود را با یکی از بازیکنان عوض می کند. ',
        action: 'کارت نقش خود را با یکی از بازیکنان عوض کنید.'),
  ];
}
