import 'package:flutter/material.dart';

import '../model/role.dart';

class Roles extends ChangeNotifier {
  List<Role> mafia = [
    Role(
        name: 'پدرخوانده',
        type: 'M',
        heart: 2,
        description:
            'او از یک بار شلیک شب لئون مصون است.یک جلیقه دارد.تعیین شلیک شب از طرف گروه به عهده پدرخوانده است و اگر از بازی خارج شود دیگر اعضا به جای او شلیک می کنند.پدرخوانده دارای توانایی حس ششم است و اگر در شب تصمیم بگیرد به جای شلیک از حس ششم استفاده کند باید نقش بازیکنی را درست حدس بزند و توسط گرداننده تائید شود.بازیکنی که پدرخوانده نقش او را درست حدس زده است سلاخی می شود یعنی اگر سپر داشته باشد یا دکتر او را سیو کرده باشد بازهم از بازی خارج می شود و آن شب توانایی وی اعمال نخواهد شد و پس از خروج از بازی توسط کنستانتین قابل احضار نمی باشد.استعلام پدرخوانده برای نوستراداموس شهروندی بوده ولی برای همشهری کین مافیایی و مثبت خواهد بود.',
        isBlocked: false,
        isReversible: true,
        isSaved: false,
        order: 1),
    Role(
      name: 'ماتادور',
      type: 'M',
      heart: 1,
      description:
          'شب ها با تیم مافیا بیدار می شود و هر شب از توانایی خود استفاده می کند.در شب هر بازیکنی را نشان دهد توانایی شب او را آن شب از وی خواهد گرفت و فرد نشان شده اگر بیدار شود با ضربدر گرداننده مواجه می شود اما فردا مجدد می تواند از توانایی اش استفاده کند.ماتادور دو شب متوالی نمی تواند یک بازیکن را نشان کند.',
      isBlocked: false,
      isReversible: true,
      isSaved: false,
      order: 2,
    ),
    Role(
      name: 'سال گودمن',
      type: 'M',
      heart: 1,
      description:
          'شب ها با تیم مافیا بیدار می شود و هر شب از توانایی خود استفاده می کند.در شب هر بازیکنی را نشان دهد توانایی شب او را آن شب از وی خواهد گرفت و فرد نشان شده اگر بیدار شود با ضربدر گرداننده مواجه می شود اما فردا مجدد می تواند از توانایی اش استفاده کند.ماتادور دو شب متوالی نمی تواند یک بازیکن را نشان کند.',
      isBlocked: false,
      isReversible: true,
      isSaved: false,
      order: 10,
    ),
  ];
  List<Role> citizen = [
    Role(
      name: 'لئون حرفه ای',
      type: 'C',
      description:
          'هرشبی که بخواهد می تواند به یکی از اعضای تیم مافیا شلیک کند.اما با شلیک اشتباه به شهروندان به مجازات خودش کشته می شود و دکتر نمی تواند او را نجات دهد.لئون یک جلیقه دارد که یکبار از تیر نجات پیدا می کند.حداکثر دو شلیک دارد.',
      heart: 2,
      isBlocked: false,
      isReversible: true,
      isSaved: false,
      order: 3,
    ),
    Role(
      name: 'دکتر واتسون',
      type: 'C',
      description:
          'هرشب می تواند جان یک نفر چه عضو مافیا و چه عضو شهروندی را نجات دهد.جان خودش را یکبار می تواند در طول بازی نجات دهد ولی در نجات جان دیگران محدودیتی ندارد.',
      heart: 1,
      isBlocked: false,
      isReversible: true,
      isSaved: false,
      order: 4,
    ),
    Role(
      name: 'همشهری کین',
      type: 'C',
      description:
          'شهروندی است که در یکی از شب ها به انتخاب خود به دعوت گرداننده یکی از بازیکنان را نشان می دهد.اگر یک مافیا را درست نشان کرده باشد صبح روز بعد گرداننده ساید مافیای نشان شده را در جمع افشا می کند.و همشهری کین شب بعد کشته می شود.دکتر توانایی نجات او را ندارد.اما اگر نشانش از ساید مافیا نبود گرداننده هیچ چیزی اعلام نخواهد کرد و همشهری کین در بازی خواهد ماند و استعلامش از بین خواهد رفت.اگر او یا نشانش کشته شوند عملیات شب وی اجرا نشده و از بین نمی رود و همچنان باقی می ماند.استعلام پدرخوانده برای همشهری کین مافیایی است.',
      heart: 1,
      isBlocked: false,
      isReversible: true,
      isSaved: false,
      order: 5,
    ),
    Role(
      name: 'کنستانتین',
      type: 'C',
      description:
          'گرداننده کنستانتین را بیدار می کند تا او به انتخاب خود و تنها یک بار یک نفر از بازیکنان اخراجی اعم از مافیا شهروند و یا مستقل را به بازی برگرداند.غیر از نقش های افشا شده.توانایی های بازیکن احضار شده ادامه پیدا می کند و از بین نمی رود و از نو نمی شود.',
      heart: 1,
      isBlocked: false,
      isReversible: true,
      isSaved: false,
      order: 6,
    ),
    Role(
        name: 'شهر ساده',
        type: 'C',
        description: '',
        heart: 1,
        isBlocked: false,
        isReversible: true,
        isSaved: false,
        order: 8),
    Role(
        name: 'شهر ساده',
        type: 'C',
        description: '',
        heart: 1,
        isBlocked: false,
        isReversible: true,
        isSaved: false,
        order: 9),
    Role(
        name: 'شهر ساده',
        type: 'C',
        description: '',
        heart: 1,
        isBlocked: false,
        isReversible: true,
        isSaved: false,
        order: 11),
  ];
  List<Role> independent = [
    Role(
        name: 'نوستراداموس',
        type: 'I',
        description:
            'در شب معارفه گرداننده او را بیدار می کند.نوستراداموس به انتخاب خود سه بازیکن را به گرداننده نشان می دهد.سپس گرداننده به او تعداد مافیا های موجود در میان این سه را اعلام می کند و پیش بینی او مبنی بر پیروزی یکی از دو ساید را از او می پرسد.نوستراداموس پیش بینی می کند شهروندان برنده خواهند شد یا مافیا ها.از این پس او برای برنده شدن سایدی که انتخاب کرده است تلاش می کند.بدون آنکه دیگر افراد بدانند وی به چه سایدی پیوسته است.اگر ساید مورد انتخابش برنده شد او نیز برنده است و اگر ساید مورد انتخابش بازنده شد او نیز بازنده خواهد شد.شلیک هیچ یک از دو ساید بر او موثر نخواهد بود و در شب کشته نخواهد شد.مگر با حس ششم پدرخوانده اما در روز با رای گیری از بازی خارج خواهد شد.استعلام پدرخوانده برای وی شهروندی خواهد بود.',
        heart: 1000,
        isBlocked: false,
        isReversible: true,
        isSaved: false,
        order: 7),
  ];
}
